using System;

//BUBBLE SORT METHOD
//Алгоритъмът работи по следния начин: взимаме първият елемент на масива 
//и го сравняваме със следващият(втория в нашия случай) и разменяме
//стойностите им, ако първият е по – голям от втория. След това сравняваме
//вторият елемент с третия и пак разменяме, ако има нужда. Ако нашият масив
//е от 10 елемента, след 9 такива сравнения най – отгоре ще изплува най – 
//голямата стойност. След това започваме отново да сравняваме като пак взимаме
//първият елемент и сравняваме с вторият и така нататък.

class BubbleSort
{
    static void Main()
    {
        int[] array = new int[] { 6, 9, 4, 3, 5, 1, 42, -2 };

        for (int i = 0; i < array.Length - 1; i++)
        {
            for (int j = 0; j < array.Length - 1; j++)
            {
                if (array[j] > array[j + 1])
                {
                    int tmp = array[j];
                    array[j] = array[j + 1];
                    array[j + 1] = tmp;
                }
            }
        }
        for (int i = 0; i < array.Length; i++)
        {
            Console.WriteLine(array[i]);
        }
    }
}